nxp-mcuxpresso/mcuxsdk-examples/_boards/evkmimxrt1020/lvgl_examples/pin_mux.h
/*
 * Copyright 2026 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/

/*! @brief Direction type  */
typedef enum _pin_mux_direction
{
  kPIN_MUX_DirectionInput = 0U,         /* Input direction */
  kPIN_MUX_DirectionOutput = 1U,        /* Output direction */
  kPIN_MUX_DirectionInputOrOutput = 2U  /* Input or output direction */
} pin_mux_direction_t;

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_B0_07 (number 101), UART1_RXD/J17[4] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_RXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_RXD_SIGNAL                                       RX   /*!< Signal name */

/* GPIO_AD_B0_06 (number 105), UART1_TXD/J17[6] */
/* Routed pin properties */
#define BOARD_INITPINS_UART1_TXD_PERIPHERAL                              LPUART1   /*!< Peripheral name */
#define BOARD_INITPINS_UART1_TXD_SIGNAL                                       TX   /*!< Signal name */

/* GPIO_AD_B0_15 (number 93), LCD_DC_GPIO_PIN/U11[25]/J19[2] */
/* Routed pin properties */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_PERIPHERAL                          GPIO1   /*!< Peripheral name */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_SIGNAL                            gpio_io   /*!< Signal name */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_CHANNEL                               15U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_GPIO                                GPIO1   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_INIT_GPIO_VALUE                        0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_GPIO_PIN                              15U   /*!< GPIO pin number */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_GPIO_PIN_MASK                 (1U << 15U)   /*!< GPIO pin mask */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_PORT                                GPIO1   /*!< PORT peripheral base pointer */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_PIN                                   15U   /*!< PORT pin number */
#define BOARD_INITPINS_LCD_DC_GPIO_PIN_PIN_MASK                      (1U << 15U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
/* Routed pin properties */
#define LPSPI1_INITPINS_ENET_RXD0_PERIPHERAL                              LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_ENET_RXD0_SIGNAL                                     SCK   /*!< Signal name */

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
/* Routed pin properties */
#define LPSPI1_INITPINS_ENET_CRS_DV_PERIPHERAL                            LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_ENET_CRS_DV_SIGNAL                                  PCS0   /*!< Signal name */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
/* Routed pin properties */
#define LPSPI1_INITPINS_ENET_RXER_PERIPHERAL                              LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_ENET_RXER_SIGNAL                                     SDO   /*!< Signal name */

/* GPIO_AD_B0_13 (number 95), ENET_TXEN/U11[23]/J19[5] */
/* Routed pin properties */
#define LPSPI1_INITPINS_ENET_TXEN_PERIPHERAL                              LPSPI1   /*!< Peripheral name */
#define LPSPI1_INITPINS_ENET_TXEN_SIGNAL                                     SDI   /*!< Signal name */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPSPI1_InitPins(void);

/* GPIO_AD_B0_10 (number 98), ENET_RXD0/U11[16]/J19[6] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_ENET_RXD0_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_ENET_RXD0_SIGNAL                               gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_ENET_RXD0_CHANNEL                                  10U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_ENET_RXD0_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_RXD0_GPIO_PIN                                 10U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_ENET_RXD0_GPIO_PIN_MASK                    (1U << 10U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_ENET_RXD0_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_RXD0_PIN                                      10U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_ENET_RXD0_PIN_MASK                         (1U << 10U)   /*!< PORT pin mask */

/* GPIO_AD_B0_11 (number 97), ENET_CRS_DV/U11[18]/J19[3] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_PERIPHERAL                           GPIO1   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_SIGNAL                             gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_CHANNEL                                11U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_GPIO                                 GPIO1   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_GPIO_PIN                               11U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_GPIO_PIN_MASK                  (1U << 11U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_PORT                                 GPIO1   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_PIN                                    11U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_ENET_CRS_DV_PIN_MASK                       (1U << 11U)   /*!< PORT pin mask */

/* GPIO_AD_B0_12 (number 96), ENET_RXER/U11[20]/J19[4] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_ENET_RXER_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_ENET_RXER_SIGNAL                               gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_ENET_RXER_CHANNEL                                  12U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_ENET_RXER_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_RXER_GPIO_PIN                                 12U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_ENET_RXER_GPIO_PIN_MASK                    (1U << 12U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_ENET_RXER_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_RXER_PIN                                      12U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_ENET_RXER_PIN_MASK                         (1U << 12U)   /*!< PORT pin mask */

/* GPIO_AD_B0_13 (number 95), ENET_TXEN/U11[23]/J19[5] */
/* Routed pin properties */
#define LPSPI1_DEINITPINS_ENET_TXEN_PERIPHERAL                             GPIO1   /*!< Peripheral name */
#define LPSPI1_DEINITPINS_ENET_TXEN_SIGNAL                               gpio_io   /*!< Signal name */
#define LPSPI1_DEINITPINS_ENET_TXEN_CHANNEL                                  13U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define LPSPI1_DEINITPINS_ENET_TXEN_GPIO                                   GPIO1   /*!< GPIO peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_TXEN_GPIO_PIN                                 13U   /*!< GPIO pin number */
#define LPSPI1_DEINITPINS_ENET_TXEN_GPIO_PIN_MASK                    (1U << 13U)   /*!< GPIO pin mask */
#define LPSPI1_DEINITPINS_ENET_TXEN_PORT                                   GPIO1   /*!< PORT peripheral base pointer */
#define LPSPI1_DEINITPINS_ENET_TXEN_PIN                                      13U   /*!< PORT pin number */
#define LPSPI1_DEINITPINS_ENET_TXEN_PIN_MASK                         (1U << 13U)   /*!< PORT pin mask */


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPSPI1_DeinitPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C4_InitPins(void);


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void LPI2C4_DeinitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
